<?php

return [
	'msg'=>[
		0	=>'操作成功',
		##10开头为登陆相关的信息或者异常信息
		'-1'=>'服务器异常,请稍后重试',
		'-2'=>'参数错误',
		'-3'=>'非法操作',
		'-6'=>'缺少参数',
		'-7'=>'验证失败',
		'-8'=>'数据异常',
		'-10'=>'token异常',
		'-11'=>'您还没有登陆,请先登陆',
		'1'=>'操作失败',
		'990'=>'手机号不能为空',
		'991'=>'手机验证码不能为空',
		'992'=>'银行卡号不能为空',
		'993'=>'开户银行不能为空',
		'994'=>'密码不能为空',
		'995'=>'手机验证码id不能为空',

		'1101'=>'验证码错误',
		'1108'=>'您的账户已被冻结，请联系客服处理',
		'1104'=>'没有此用户',
		'1105'=>'密码错误',
		'1107'=>'该手机号码已存在',
		'1109'=>'该手机号码已注册',
		'1110'=>'图形验证码不能为空',
		'1111'=>'图形验证码不正确',
		'1112'=>'手机验证码错误',
		'1113'=>'两次输入的密码不一致',

		'1114'=>'新的手机号码不能和原手机号相同',

		'2201'=>'该众筹非众筹中，无法认筹!',
		'2202'=>'不能投自己发起的众筹!',
		'2203'=>'不能投自己发起的众筹!',
		'2204'=>'支付密码错误，请重试!',
		'2205'=>'该众筹非投票中状态，不能投票！',
		'2206'=>'该众筹还未发起投票，不能投票！',
		'2207'=>'该众筹投票已经结束！',
		'2208'=>'您未参与该众筹，不能投票！',
		'2209'=>'余额不足，请充值!',
		'2210'=>'输入的金额大于最大可投金额',
		'2211'=>'众筹还未开始',
		'2212'=>'众筹还未开始或已经结束',
		'2213'=>'每个项目只能使用一次红包！',
		'2214'=>'项目不能使用红包',

		'3301'=>'新手体验金不够',
		'3302'=>'体验项目已满标',

		'6601'=>'身份证号已被使用',
		'6602'=>'真实姓名不能为空',
		'6603'=>'身份证号不能为空',
		'6606'=>'认证出错',
		'6607'=>'没有设置银行卡，请先设置银行卡',
		'6608'=>'没有实名认证，请先实名认证',
		'6609'=>'实名信息已被锁定',
		'6610'=>'银行卡信息已被锁定',


		'7701'=>'银行卡已被使用',
		'7702'=>'已经绑定银行卡',

		'8801'=>'提现额大于帐户余额',
		'8802'=>'提现规则设置有误，请联系管理员',
		'8803'=>'红包已被使用',
		'8804'=>'此红包金额不合规',##（一般都是金额达不到）
		'8805'=>'金额不能小于100元',


	],

];